Repository: k-droscova/lifeisskillapp
Catalog: lifeisskillapp/LiS/Resources/Resources/StringResources/Localizable.xcstrings
Source language: en
Languages: cs, de

# profile.back.button
source: Back
cs: Zpět
de: Zurück

# profile.birthday
source: Date of birth:
cs: Datum narození:
de: Geburtsdatum:

# profile.invite.button
source: Invite friend
cs: Pozvat přátele
de: Freunde einladen

# profile.main_category
source: Main category:
cs: Hlavní kategorie:
de: Hauptkategorie:

# profile.name
source: Name:
cs: Jméno:

# profile.parent_email.button_prompt
source: Resend activation link:
cs: Zaslat aktivační odkaz znovu:
de: Aktivierungslink erneut senden:

# profile.parent_email.prompt
source: Guardian's Activation Required
cs: Vyžadována aktivace opatrovníka
de: Aktivierung des Vormunds erforderlich

# profile.parent_email.textfield
source: Enter guardian's email
cs: Vyplň email opatrovníka
de: Geben Sie die E-Mail-Adresse des Vormunds ein

# profile.phone
source: Phone:
cs: Tel:
de: Telefon:

# profile.postal_code
source: Postal code:
cs: PSČ:
de: Postleitzahl:

# profile.register.button
source: Complete registration
cs: Dokončit registraci
de: Registrierung abschließen

# profile.relation
source: Relation:
cs: Vztah:
de: Verwandtschaft:

# rank.title
source: Rank
cs: Pořadí
de: Rang

# register.button
source: Sign up
cs: Zaregistrovat se
de: Registrieren

# register.consent
source: I am consenting with:
cs: Souhlasím s:
de: Ich stimme zu mit:

# register.consent.rules
source: Rules
cs: Pravidly
de: Regeln

# register.date_of_birth
source: Date of birth:
cs: Datum narození:
de: Geburtsdatum:

# register.date_of_birth.age:
source: Your age: %@
cs: Tvůj věk: %@
de: Ihr Alter: %@

# register.date_of_birth.instructions
source: Choose your birthday:
cs: Vyber si svůj datum narození
de: Wählen Sie Ihr Geburtsdatum

# register.first_name
source: First name
cs: Jméno
de: Vorname

# register.gender
source: Gender:
cs: Pohlaví:
de: Geschlecht:

# register.gender.female
source: Female
cs: Žena
de: Weiblich

# register.gender.male
source: Male
cs: Muž
de: Männlich

# register.guardian_info
source: Guardian's information
cs: Informace o zákonném zástupci
de: Angaben des Erziehungsberechtigten

# register.guardian_relationship
source: Relationship to you
cs: Vztah k tobě
de: Beziehung zu Ihnen

# register.last_name
source: Last name
cs: Příjmení
de: Nachname

# register.password
source: Password
cs: Heslo
de: Passwort

# register.password_confirm
source: Confirm password
cs: Potvrdit heslo
de: Passwort bestätigen

# register.phone_number
source: Phone number
cs: Telefon
de: Telefonnummer

# register.postal_code
source: Postal Code
cs: PSČ
de: Postleitzahl

# register.submit_button
source: Complete registration
cs: Dokončit registraci
de: Registrierung abschließen

# register.success.message
source: First part of registration was succcessful. You will be able to login once you activate your account through link in your email. After you login, navigate to your profile through menu to complete registration process. You can still scan points without full registration, but the functionalities are limited. You must complete full registration within 30 days.
cs: První část registrace byla úspěšná. Budeš se moct přihlásit, jakmile si aktivuješ svůj účet prostřednictvím odkazu ve svém e-mailu. Po přihlášení přejdi přes menu do svého profilu, kde můžeš dokončit proces registrace. Skenovat body lze i bez dokončení registrace, ale funkce jsou omezené. Plnou registraci musíš dokončit do 30 dnů.
de: Der erste Teil der Registrierung war erfolgreich. Sie können sich einloggen, sobald Sie Ihr Konto über den Link in Ihrer E-Mail aktiviert haben. Nach dem Einloggen navigieren Sie über das Menü zu Ihrem Profil, um den Registrierungsprozess abzuschließen. Sie können Punkte scannen, ohne die vollständige Registrierung abgeschlossen zu haben, aber die Funktionen sind eingeschränkt. Sie müssen die vollständige Registrierung innerhalb von 30 Tagen abschließen.

# register.success.title
source: You are almost registered
cs: Registrace je skoro hotová
de: Sie sind fast registriert

# register.user_info.instructions
source: Please complete the registration by filling out this form. If you are under 15 years old, you will be asked to provide a guardian's information as well. In that case, the registration will be complete once they validate their email.
cs: Prosím, dokonči registraci vyplněním tohoto formuláře. Pokud je ti méně než 15 let, budeš požádán o poskytnutí informací o zákonném zástupci. V tomto případě bude registrace dokončena, jakmile zákonný zástupce potvrdí svůj e-mail.
de: Bitte vervollständigen Sie die Registrierung, indem Sie dieses Formular ausfüllen. Wenn Sie unter 15 Jahre alt sind, werden Sie gebeten, die Informationen eines Erziehungsberechtigten anzugeben. In diesem Fall wird die Registrierung abgeschlossen, sobald der Erziehungsberechtigte seine E-Mail bestätigt.

# register.user_info.title
source: Your information
cs: Informace o tobě
de: Ihre Angaben

# register.username
source: Username
cs: Uživatelské jméno
de: Benutzername

# register.validation.email.format
source: Please enter valid email.
cs: Zadej validní emailovou adresu.
de: Bitte geben Sie eine gültige E-Mail-Adresse ein.

# register.validation.email.guardian_matches_user
source: You cannot use the same email as for registration
cs: Nemůžeš použít stejný e-mail jako pro registraci.
de: Sie können nicht die gleiche E-Mail-Adresse wie bei der Registrierung verwenden.

# register.validation.email.taken
source: Email is already taken.
cs: Tento email je již používán.
de: Email ist bereits vergeben.

# register.validation.empty
source: Field can't be empty.
cs: Pole nesmí být prázdné.
de: Das Feld darf nicht leer sein.

# register.validation.password.format
source: Password must have at least %@ characters.
cs: Heslo musí mít alespoň %@ znaků.
de: Das Passwort muss mindestens %@ Zeichen enthalten.

# register.validation.password.mismatch
source: Passwords don't match.
cs: Hesla se neshodují.
de: Passwörter stimmen nicht überein.

# register.validation.phone.invalidFormat
source: Ensure you wrote valid phone number
cs: Napiš validní telefonní číslo
de: Stellen Sie sicher, dass Sie eine gültige Telefonnummer eingegeben haben

# register.validation.username.short
source: Username must have at least %@ characters.
cs: Uživatelské jméno musí mít alespoň %@ znaků.
de: Der Benutzername muss mindestens %@ Zeichen enthalten.

# register.validation.username.taken
source: Username already taken.
cs: Toto uživatelské jméno je již používáno.
de: Der Benutzername wird bereits verwendet.

# registration.reference.instructions.body
source: If you have a friend that is already registered, they can invite you to the game and both of you will get benefits!
cs: Pokud máš kamaráda, který je již zaregistrovaný, může tě pozvat do hry a oba získáte výhody!
de: Wenn du einen Freund hast, der bereits registriert ist, kann er dich zum Spiel einladen, und ihr beide werdet Vorteile erhalten!

# registration.reference.qr.error.message
source: Ensure you are scanning the correct QR code. If issue persists contact us at info@lifeisskill.cz.
cs: Ujisti se, že skenuješ správný QR kód. Pokud problém přetrvává, kontaktuj nás na info@lifeisskill.cz.
de: Stelle sicher, dass du den richtigen QR-Code scannst. Falls das Problem weiterhin besteht, kontaktiere uns unter info@lifeisskill.cz.

# registration.reference.qr.error.title
source: Reference scanning failed
cs: Skenování referenta selhalo
de: Referenz-Scan fehlgeschlagen

# registration.reference.qr.scanning.instructions
source: Instruct your friend to open their profile in the app through menu in upper right corner. In profile, click on "Generate QR" and then scan it.
cs: Řekni svému kamarádovi, aby otevřel svůj profil v aplikaci přes menu v pravém horním rohu. V profilu ať klikne na „Vygenerovat QR“, který poté naskenuj.
de: Weise deinen Freund an, sein Profil in der App über das Menü in der oberen rechten Ecke zu öffnen. Im Profil klicke auf „QR-Code generieren“ und scanne ihn dann.

# registration.reference.qr.success.message
source: Ensure that the username in the form matches your friend's username.
cs: Ujisti se, že uživatelské jméno ve formuláři odpovídá uživatelskému jménu tvého kamaráda.
de: Stelle sicher, dass der Benutzername im Formular mit dem Benutzernamen deines Freundes übereinstimmt.

# registration.reference.qr.success.title
source: Reference scanned successfully
cs: Skenování proběhlo úspěšně
de: Referenz erfolgreich gescannt

# registration.reference.title
source: Add reference
cs: Přidat referenci
de: Einladung hinzufügen

# registration.reference.user
source: Reference's username:
cs: Uživatelské jméno referenta:
de: Benutzername des Einladers:

# registration.reference.user.placeholder
source: Click button on the right to scan user
cs: Stiskni tlačítko vpravo pro načtení referenta
de: Klicken Sie auf den Button rechts, um den Benutzer zu scannen.

# settings.field.account.title
source: My Profile
cs: Můj profil
de: Mein Profil

# settings.field.contact.title
source: Report a Problem
cs: Nahlásit problém
de: Ein Problem melden

# settings.field.info.title
source: About application
cs: O aplikaci
de: Über die Anwendung

# settings.field.manual.title
source: Help
cs: Nápověda
de: Hilfe

# settings.field.notifications.title
source: Notifications
cs: Upozornění
de: Benachrichtigungen

# settings.field.prize.title
source: Prizes
cs: Výhry
de: Preise

# settings.field.rules.title
source: Game Rules
cs: Pravidla hry
de: Spielregeln

# settings.field.share.invite_message
source: Come play the LifeIsSkill game with me. You can win a holiday, a sightseeing flight, or a bike. 🎁 It's simple. Download the app, collect points, and win great prizes. 🏅 (intended for players aged 6 to 18 years)
cs: Pojď se mnou hrát LifeIsSkill hru. Můžeš vyhrát dovolenou, vyhlídkový let nebo kolo. 🎁 Je to jednoduché. Stáhni aplikaci, sbírej body a vyhraj skvělé ceny. 🏅 (určeno pro hráče ve věku od 6 do 18 let)
de: Komm und spiele das LifeIsSkill-Spiel mit mir. Du kannst eine Urlaubsreise, einen Rundflug oder ein Fahrrad gewinnen. 🎁 Es ist einfach. Lade die App herunter, sammle Punkte und gewinne tolle Preise. 🏅 (für Spieler im Alter von 6 bis 18 Jahren)

# settings.field.share.title
source: Share with Friends
cs: Sdílej nás kamarádům
de: Mit Freunden teilen

# settings.field.sponsors.title
source: Game Sponsors
cs: Partneři naší hry
de: Spielsponsoren

# settings.logout
source: Logout
cs: Odhlásit se
de: Abmelden

# settings.mail.footer.title
source: Don't remove text below!
cs: Pokud máte problém, prosím nemažte text níže. Slouží k rychlejšímu vyřešení problému.
de: Löschen Sie den Text unten nicht!

# settings.mail.footer.username
source: Username
cs: Uživatelské jméno
de: Benutzername

# settings.mail.subject
source: Message from application
cs: Zpráva z aplikace od
de: Nachricht von der Anwendung

# settings.onboarding
source: How to?
cs: Jak na to?
de: Wie geht das?

# settings.profile
source: User's profile
cs: Profil uživatele
de: Benutzerprofil

# settings.section.main
source: General
cs: Obecné
de: Allgemein

# settings.section.personal
source: Personal
cs: Osobní
de: Persönlich

# settings.settings
source: Settings
cs: Nastavení
de: Einstellungen

# settings.title
source: Settings
cs: Nastavení
de: Einstellungen

# stats.myPosition
source: Rank: %d.
cs: Pořadí: %d.
de: Rang: %d.
